[
  {
    "build": 23,
    "date": "2026-01-01",
    "notes": "Metronome fixes - stops when exiting PDF or switching songs. Time signature now updates correctly. 30-minute screen timeout in PDF viewer. Extended auto-hide delay when adjusting settings."
  },
  {
    "build": 22,
    "date": "2025-12-31",
    "notes": "Metronome settings - choose from 5 sounds (wood block, cowbell, hi-hat, click, silent) or disable sound entirely. Haptic feedback option. Beat pulse overlay shows visual rhythm cue on the PDF. All settings persist across sessions."
  },
  {
    "build": 21,
    "date": "2025-12-30",
    "notes": "Metronome in PDF viewer - tap the BPM badge to start/stop. Tempo and time signature from the chart. Swipe left/right to adjust tempo. Auto-hides controls after 5 seconds."
  },
  {
    "build": 20,
    "date": "2025-12-27",
    "notes": "Ambitus display - see note range for each key in the transpose modal. Treble clef indicator shows staff context. Fixed crash on older iOS devices. Groove Sync sessions now auto-expire after 15 minutes of inactivity. Unified About page with feature descriptions."
  },
  {
    "build": 19,
    "date": "2025-12-27",
    "notes": "Groove Sync follower - when someone in your band starts sharing charts, you'll see a prompt to follow along. Charts auto-open transposed for your instrument as the leader navigates. Also: per-song octave offset preferences now save to your profile."
  },
  {
    "build": 15,
    "date": "2025-12-21",
    "notes": "Minor key fix, simplified song cards showing standard + preferred key, print PDF from viewer, deep link band invites (jazzpicker://join/code), key picker highlights standard key with bold outline, context-aware sharp/flat spelling."
  },
  {
    "build": 13,
    "date": "2025-12-17",
    "notes": "Bands - share setlists with your group. Create a band in Settings, share the join code, and everyone sees the same setlists in real-time. Preferred keys now sync across devices too. Setlist renaming via Edit button or swipe."
  },
  {
    "build": 10,
    "date": "2025-12-10 4:20pm PST",
    "notes": "Larger browse cards on iPad showing composer and your preferred key. Unified search finds songs by title or composer. Last-used key for each song now persists across app restarts."
  },
  {
    "build": 9,
    "date": "2025-12-10",
    "notes": "Quick 'Add to [setlist]' action in PDF viewer. Composer now shown in browse UI."
  },
  {
    "build": 7,
    "date": "2025-12-10 10am PST",
    "notes": "Added Apple Sign-In for iOS authentication. Setlists now sync in real-time via Firestore - create or edit a setlist on iPad and it appears instantly on web, and vice versa. No more manual refresh needed. User profiles store your instrument preference across devices."
  },
  {
    "build": 6,
    "date": "2025-12-06 6pm",
    "notes": "Octave +/- controls in PDF viewer menu. Adjusts chart up or down by octave (±2 range) when transposition lands notes too high or low. Shown in title bar when active. Resets on key or song change. Each octave variant cached separately for offline use."
  },
  {
    "build": 5,
    "date": "2025-12-06 10am",
    "notes": "iOS: Pull-to-refresh now works inside setlists. Setlists sync to server via device ID - edits from web appear after refresh. Edit controls disabled when offline. Web: Removed Supabase auth in favor of device ID (simpler, no login required). Removed Capacitor bridge since we now have native SwiftUI app. Setlists are now shared across iOS and web using the same server API."
  },
  {
    "build": 4,
    "date": "2025-12-04",
    "notes": "Offline PDF caching - songs load instantly when cached, usable offline for a gig"
  },
  {
    "build": 3,
    "date": "2025-12-04",
    "notes": "Setlist reordering, About page with build history"
  },
  {
    "build": 2,
    "date": "2025-12-04",
    "notes": "setlists working somewhat"
  },
  {
    "build": 1,
    "date": "2025-12-04",
    "notes": "Initial TestFlight build"
  }
]
